app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("address", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["address", "Moreland Ave NE and Seaboard Ave NE"], ["city", "Atlanta"], ["created_at", "2018-12-26 17:36:26.682972"], ["updated_at", "2018-12-26 17:36:26.682972"]]

    def set_location
      @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]